a = 2026 - 1940
b = input("Здравствуйте! Как Вас зовут?")
print("Очень приятно,", b, "! Меня зовут Марк.")
c = int(input("Сколько Вам лет?"))
if c < a:
    print("Да,", b, "я старше вас на ", a-c, "лет")
else:
    print("Да,", b, "вы старше меня на ", c - a, "лет")
d = input("Вам нравится программировать?")
if d == "нет":
    print("Жаль. Я думал, Вы сможете написать интересную программу для меня.")
else:
    print("Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.")
