a = input("Собака короткошерстной породы?")
b = input("Рост собаки менее 50см?")
if a == "да":
    if b == "да":
        c == input("у собаки короткий хвост?")
        if c == "да":
            print("английский бульдог")
        else:
            d == input("у собаки длинные уши?")
            if d == "да":
                print("гончая")
            else:
                e == input("У собаки короткое тело?")
                if e == "да":
                    print("мопс")
                else:
                    print("чихуахуа")
    else:
        f = input("Собака весит более 50 кг?")
        if f == "да":
            print("Датский дог")
        else:
            print("фоксхаунд")
else:
    if b == "да":
        g = input("У собаки доброжелательный характер?")
        if g == "да":
            print("кокер-спаниэль")
        else:
            print("ирландский сеттер")
        
    else:
        h = input("у собаки рост менее 70см?")
        if h == "да":
            i = input("у собаки длиннные уши?")
            if i == "да":
                print("большой вандейский грифон")
            else:
                print("копли")
        else:
            j = input("окрас рыжий с белыми отметинами?")
            if j == "да":
                print("сенбернар")
            else:
                k = input("Белоснежный окрас?")
                if k == "да":
                    print("ирландский волкодав")
                else:
                    print("ньюфаундленд")
